# 이름을 입력하세요 : 홍길동

# name = input('이름을 입력하세요 : ')
# input()의 역할:
# 1. 입력할 수 있도록 앞부분에 '이름을 입력하세요 : '라고 프린트
# 2. 입력한 데이터를 파이썬 프로그램으로 가지고 들어와주는 역할을 담당
# => 이렇게 입력한 데이터를 우리는 램에 변수를 만들어 일단 저장해두고 본다.

# 프로그래머가 직접 변수에 값을 집어 넣을 때
# 연산가능한 숫자로 넣고 싶으면 ''(따옴표)기호를 빼고 넣으면
# 컴퓨터는 숫자로 인식한다.
# move = 0.5
# 하지만, 아래와 같이 입력을 통해 변수에 값을 집어 넣을 때는
# 컴퓨터는 숫자와 문자를 구분할 수 없어서
# 일단 모든 입력값을 String(문자열)로 인식하여 값을 가지고 들어온다.
# 이것을 연산가능한 숫자로 사용하고자 하는 경우
# 프로그래머가 수동으로 명령어(함수)를 사용하여 String을
# 숫자로 바꾸어주는 작업을 해야한다.
# 실수로 변경하고자 하는 경우 float(입력받은 String값)
# 정수로 변경하고자 하는 경우 int(입력받은 int값)
# eye = input('시력을 입력하세요 : ') #'1.5'
# eye2 = float(eye) #String->실수로 변환!

# num = 10
# if num > 100: #True
#     #이부분 실행
# else: #False, num <= 100
#     # 이부분 실행







